iTower_20__GIS_Управление_пространственными_данными/src/Documents/гисВводЗначенийПоказателяПоОбъектам/гисВводЗначенийПоказателяПоОбъектам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гисВводЗначенийПоказателяПоОбъектам</name>
  <registerRecords>InformationRegister.гисЗначенияПоказателейОбъектов</registerRecords>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.гисПоказатели</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Значения</name>
    <attributes>
      <name>ОбъектКарты</name>
      <type>
        <types>CatalogRef.гисОбъектыКарты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>Number</types>
        <types>CatalogRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

iTower_20__GIS_Управление_пространственными_данными/src/InformationRegisters/гисЗначенияПоказателейОбъектов/гисЗначенияПоказателейОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гисЗначенияПоказателейОбъектов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЗначениеЧисло</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеБулево</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеСправочник</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.гисОбъектыКарты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.гисПоказатели</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iTower_20__GIS_Управление_пространственными_данными/src/Enums/гисПоказателиТипы/гисПоказателиТипы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гисПоказателиТипы</name>
  <enumValues>
    <name>Число</name>
  </enumValues>
  <enumValues>
    <name>Булево</name>
  </enumValues>
  <enumValues>
    <name>Справочник</name>
  </enumValues>
</mdclass:Enum>

iTower_20__GIS_Управление_пространственными_данными/src/Documents/гисВводЗначенийПоказателяПоОбъектам/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	// регистр гисЗначенияПоказателейОбъектов
	Движения.гисЗначенияПоказателейОбъектов.Записывать = Истина;
	Для Каждого СтрокаПоказателей Из Значения Цикл
		Движение = Движения.гисЗначенияПоказателейОбъектов.Добавить();
		Движение.Период = Дата;
		Движение.Показатель = Показатель;
		Движение.Объект = СтрокаПоказателей.ОбъектКарты;
		
		Если Показатель.ТипЗначения = Перечисления.гисПоказателиТипы.Число Тогда
			Движение.ЗначениеЧисло = СтрокаПоказателей.Значение;
		ИначеЕсли Показатель.ТипЗначения = Перечисления.гисПоказателиТипы.Булево Тогда
			Движение.ЗначениеБулево = СтрокаПоказателей.Значение;
		ИначеЕсли Показатель.ТипЗначения = Перечисления.гисПоказателиТипы.Справочник Тогда
			Движение.ЗначениеСправочник = СтрокаПоказателей.Значение;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
